%将现有数据进行预处理
%对24天的数据进行处理（其中4.6，4.15数据大量丢失，舍弃本次数据）
%现对22天的数据进行处理
%将每个测点每天的压力数据整理到一个矩阵中，然后进行分析

%一下为数据丢失情况
% 20150320 数据完整
% 20150321 数据完整
% 20150324 测点2数据大量缺失
% 20150325 测点2数据大量缺失
% 20150326 测点2，6，7数据大量缺失
% 20150327 测点2，6，7数据大量缺失
% 20150328 测点2，6，7数据大量缺失
% 20150329 测点2，6，7数据大量缺失
% 20150330 测点2，6，7数据大量缺失
% 20150331 测点2，6，7数据大量缺失
% 20150401 测点2，6，7数据大量缺失
% 20150402 测点2，6，7数据大量缺失
% 20150403 数据完整
% 20150404 数据完整
% 20150405 数据完整
% 20150406 数据全部丢失
% 20150408 数据完整
% 20150409 数据完整
% 20150410 数据完整
% 20150411 测点1数据大量缺失
% 20150412 测点1数据大量缺失
% 20150413 测点1，11数据大量缺失
% 20150414 测点1，11数据大量缺失
% 20150415 数据全部丢失

clc;
clear all;
%% 载入数据
load('C:\Users\hongwei_lab\Desktop\IESLAB\SCADA-Data\observe4_3.mat');
path = 'C:\Users\hongwei_lab\Desktop\IESLAB\SCADA-Data\';%实 验室hongwei_PC文件路径
% path = 'C:\Users\hongwei\Desktop\IESLAB\SCADA-Data\';%hongwei_PC文件路径
% path = 'C:\Users\zh\Desktop\hongweili\IESLAB\SCADA-Data\';%张慧PC路径
fileName= 'PressureData.xls';
sheetName = [
 '2015-04-04'
 '2015-04-05'
 '2015-04-08'
 '2015-04-09'
 '2015-04-10'
];
Path = [path,fileName];%实验室路径

monitorNum = 14;    %监测点个数
sampleNum  = 1440;  %采样点数，即1个/分钟
[row,column] = size(sheetName);
